<template>
    <div>
        <Description :key="description" v-for="description in descriptions"
                     :id="description.id"
                     :text="description.text" :img="description.img" :title="description.title"
                     :is-mirrored="description.isMirrored"
        ></Description>
    </div>
</template>

<script>
  import Description from "./Description";

  export default {
    name: "Descriptions",
    components: {Description},
    data: function () {
      return {
        descriptions: [
          {
            id: 'about',
            title: 'Об авторе',
            img: require('../assets/author.jpg'),
            text: 'стро дицтас инсоленс вих. Еним тибияуе ан пер, пер еи сцаевола аццусамус. Еос партем салутанди ет, не промпта фацилис сингулис мел. Ид яуо яуод яуас еффициенди. Ут вис маиорум омнесяуе. Ад ест дицат лабитур, при мовет лаудем опортере ет. Усу ассум репрехендунт те, про еу пробо алияуам инермис. Ехерци путант мандамус при ин, цу хас яуем алиенум интеллегат. Ан инсоленс инцидеринт цонцлусионемяуе иус. Суас деленити меи ин, семпер пертинациа ех вим. ид, афферт реформиданс хис еа. Ад ессе ностро елаборарет яуи, сед ин интегре инермис цонсулату.',
          },
          {
            id: 'books',
            title: 'Ландыш на крови',
            img: require('../assets/book_1.jpg'),
            text: 'Саша Браницкий – избалованный сын олигарха. Он глуп и жесток по отношению к тем, кто не может похвастаться наличием материальных ценностей в своей жизни. Саша коротает время в праздности и однажды совершает убийство незнакомого человека. Ему не грозит наказание свыше, зачатки совести слишком слабы. Время течет в привычном русле до того момента, как одним дождливым вечером на пороге его дома оказываются двое незнакомцев. Встреча с ними превращает жизнь Браницкого в тягучий кошмар.',
            isMirrored: true
          },
          {
            title: 'Алента',
            img: require('../assets/book_2.jpg'),
            text: 'Исторический роман, охвативший почти весь период существования Советского Союза, предстаёт перед читателем в форме дневников главного героя. Каждая запись посвящена ключевым моментам его биографии. Еще в раннем детстве Николай Адаменко испытал на себе все тяготы репрессий, прошёл через войну и фашистские концлагеря. Безумие и смерть следовали за ним повсюду, предрекая бесславный конец. Однако герой раз за разом ускользал от гибели благодаря вмешательству загадочного существа по имени Алента.',
          }
        ]
      }
    }
  }
</script>

<style scoped>

</style>